# Series

In [13]:
obj = pd.Series([4, 7, -5, 3])

In [14]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [15]:
obj.isnull()

0    False
1    False
2    False
3    False
dtype: bool

In [8]:
import pandas as pd
import numpy as np
# converting data into dataFrame
data={'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [16]:
obj.isnull().sum()

0

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [6]:
frame.shape

(6, 3)

In [7]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [9]:
frame['new_colum']=np.arange(6)

In [10]:
frame.head()

    state  year  pop  new_colum
0    Ohio  2000  1.5          0
1    Ohio  2001  1.7          1
2    Ohio  2002  3.6          2
3  Nevada  2001  2.4          3
4  Nevada  2002  2.9          4

In [11]:
frame.mean()

C:\Users\Sumair Ali\AppData\Local\Temp\ipykernel_7616\555050398.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  frame.mean()

year         2001.50
pop             2.55
new_colum       2.50
dtype: float64

In [12]:
frame.describe()

              year       pop  new_colum
count     6.000000  6.000000   6.000000
mean   2001.500000  2.550000   2.500000
std       1.048809  0.836062   1.870829
min    2000.000000  1.500000   0.000000
25%    2001.000000  1.875000   1.250000
50%    2001.500000  2.650000   2.500000
75%    2002.000000  3.125000   3.750000
max    2003.000000  3.600000   5.000000